# Series

In [1]:
 import numpy as np

In [2]:
import pandas as pd

In [3]:
labels = ['a','b','c']
my_data = [10,20,30]
arr = np.array(my_data)
d = {'a':10, 'b':20,'c':30}

In [4]:
arr

array([10, 20, 30])

In [5]:
pd.Series(data=my_data)

0    10
1    20
2    30
dtype: int64

In [6]:
pd.Series(data=my_data,index=labels)

a    10
b    20
c    30
dtype: int64

In [7]:
pd.Series(my_data,labels) #no need for (data=, index=)

a    10
b    20
c    30
dtype: int64

In [8]:
pd.Series(arr,labels) #this shows that panda series works with lists and arrays

a    10
b    20
c    30
dtype: int32

In [9]:
pd.Series(d)  #it also work with dictionary

a    10
b    20
c    30
dtype: int64

In [10]:
pd.Series(data=[sum,print,len]) # your data can be any kind of input, even functions

0      <built-in function sum>
1    <built-in function print>
2      <built-in function len>
dtype: object

In [11]:
ser1 = pd.Series([1,2,3,4],['USA','Germany','USSR','Japan']) 
# you can input them manually

In [12]:
ser1  #and it can be stored in a varaible

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [13]:
ser2 = pd.Series([1,2,3,4],['USA','Germany','Italy','Japan'])

In [14]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [15]:
ser1['USA'] #you can summon them just like a list

1

In [16]:
ser1

USA        1
Germany    2
USSR       3
Japan      4
dtype: int64

In [17]:
ser2

USA        1
Germany    2
Italy      3
Japan      4
dtype: int64

In [18]:
ser1 +ser2  #normal operation work on them as well

Germany    4.0
Italy      NaN
Japan      8.0
USA        2.0
USSR       NaN
dtype: float64

# Data Frame

## Part 1

#### creating a data fram, and Summoning Columns from it

In [19]:
from numpy.random import randn

In [20]:
np.random.seed(101) #the seed is to match the videa 
                    #(it returns constant value for the number inputed)

In [21]:
df = pd.DataFrame(randn(5,4),['A','B','C','D','E',],['W','X','Y','Z'])

#data frames are series in a matrix, see below:

In [22]:
df #w,x,y,z all are series with a,b,c,d being the indexies

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [23]:
df['W'] #see w is just a serie
        # also summoning the column is similar to summoning a list

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [24]:
type(df['W']) #this tells you the typd of the input u add

pandas.core.series.Series

In [25]:
type(df)

pandas.core.frame.DataFrame

In [26]:
df.W  # The other way to summon a column, but not recommended, 
      # Because the . is also used to call other funtion and python might get confused

A    2.706850
B    0.651118
C   -2.018168
D    0.188695
E    0.190794
Name: W, dtype: float64

In [27]:
df[['W','Z']] # to call multiple of columns

          W         Z
A  2.706850  0.503826
B  0.651118  0.605965
C -2.018168 -0.589001
D  0.188695  0.955057
E  0.190794  0.683509

#### adding new colums/ Removing columns or rows

In [28]:
df['new'] = df['W']+df['Y']

In [29]:
df

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [30]:
df.drop('new',1) # 0 for rows and 1 for colums, see df.shape note below

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [31]:
df #dose not prema remove it

          W         X         Y         Z       new
A  2.706850  0.628133  0.907969  0.503826  3.614819
B  0.651118 -0.319318 -0.848077  0.605965 -0.196959
C -2.018168  0.740122  0.528813 -0.589001 -1.489355
D  0.188695 -0.758872 -0.933237  0.955057 -0.744542
E  0.190794  1.978757  2.605967  0.683509  2.796762

In [32]:
df.drop('new',1,inplace=True) #to perma remove it

In [33]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [34]:
df.drop('E') #in here adding 0 is not necessary as its automatically set to 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057

In [35]:
df.shape #rows and colums, rows = 0th and colums = 1st

(5, 4)

#### Summon rows:

In [36]:
df.loc['C']  # this shows that rows are series as well 
             # and you need loc to summon them

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

In [37]:
df.iloc[2]  # to call it by index location rather than it name

W   -2.018168
X    0.740122
Y    0.528813
Z   -0.589001
Name: C, dtype: float64

#### selecting set of rows and columns

In [38]:
df.loc['B','Y']

-0.8480769834036315

In [39]:
df.loc[['A','B'],['W','Y']]  #rows, columns

          W         Y
A  2.706850  0.907969
B  0.651118 -0.848077

## part 2

#### conditonal selection

In [40]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [41]:
booldf = df > 0

In [42]:
df[booldf]

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [43]:
df[df>0] #same

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118       NaN       NaN  0.605965
C       NaN  0.740122  0.528813       NaN
D  0.188695       NaN       NaN  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [44]:
df['W']>0

A     True
B     True
C    False
D     True
E     True
Name: W, dtype: bool

In [45]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [46]:
df[df['W']>0] #This will only return values that are true in w 
              # and accordingly return the rest

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [47]:
df[df['Z']<0]

          W         X         Y         Z
C -2.018168  0.740122  0.528813 -0.589001

In [48]:
df[df['W']>0]['X'] #one way

A    0.628133
B   -0.319318
D   -0.758872
E    1.978757
Name: X, dtype: float64

In [49]:
wwResult = df[df['W']>0] # the other method :D
wwResult[['Y','X']]

          Y         X
A  0.907969  0.628133
B -0.848077 -0.319318
D -0.933237 -0.758872
E  2.605967  1.978757

In [50]:
boolser = df['W']>0
result = df[boolser]
mycols = ['X','Y']
result[mycols] 
# this is the same as df[df['W']>0]['X']

          X         Y
A  0.628133  0.907969
B -0.319318 -0.848077
D -0.758872 -0.933237
E  1.978757  2.605967

In [51]:
result  # all the data without the c as it is lower than 0

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [52]:
df[(df['W']>0) & (df['Y']>1)]  #python doesnot understad 'and' so use '&'

          W         X         Y         Z
E  0.190794  1.978757  2.605967  0.683509

In [53]:
df[(df['W']>0) | (df['Y']>1)] # this is for 'or'

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

##### work on index

In [54]:
df.reset_index() #this is to reset the index

  index         W         X         Y         Z
0     A  2.706850  0.628133  0.907969  0.503826
1     B  0.651118 -0.319318 -0.848077  0.605965
2     C -2.018168  0.740122  0.528813 -0.589001
3     D  0.188695 -0.758872 -0.933237  0.955057
4     E  0.190794  1.978757  2.605967  0.683509

In [55]:
df

          W         X         Y         Z
A  2.706850  0.628133  0.907969  0.503826
B  0.651118 -0.319318 -0.848077  0.605965
C -2.018168  0.740122  0.528813 -0.589001
D  0.188695 -0.758872 -0.933237  0.955057
E  0.190794  1.978757  2.605967  0.683509

In [56]:
newind = 'CA NY WY OR CP'.split()
newind

['CA', 'NY', 'WY', 'OR', 'CP']

In [57]:
df['States'] = newind

In [58]:
df

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CP

to make "state" an index:

In [59]:
df.set_index('States') # this is to set a new index

               W         X         Y         Z
States
CA      2.706850  0.628133  0.907969  0.503826
NY      0.651118 -0.319318 -0.848077  0.605965
WY     -2.018168  0.740122  0.528813 -0.589001
OR      0.188695 -0.758872 -0.933237  0.955057
CP      0.190794  1.978757  2.605967  0.683509

In [60]:
df #but it is not save, you need to add True to make it perma

          W         X         Y         Z States
A  2.706850  0.628133  0.907969  0.503826     CA
B  0.651118 -0.319318 -0.848077  0.605965     NY
C -2.018168  0.740122  0.528813 -0.589001     WY
D  0.188695 -0.758872 -0.933237  0.955057     OR
E  0.190794  1.978757  2.605967  0.683509     CP

## Part 3

In [61]:
# Index Levels
outside = ['G1','G1','G1','G2','G2','G2']
inside = [1,2,3,1,2,3]
hier_index = list(zip(outside,inside))
hier_index = pd.MultiIndex.from_tuples(hier_index) 

#Creating a data frame but is more complicated

In [62]:
df = pd.DataFrame(randn(6,2),hier_index,['A','B'])

In [63]:
df

             A         B
G1 1  0.302665  1.693723
   2 -1.706086 -1.159119
   3 -0.134841  0.390528
G2 1  0.166905  0.184502
   2  0.807706  0.072960
   3  0.638787  0.329646

# Missing Data

In [64]:
d = {'A':[1,2,np.nan], 'B':[5,np.nan,np.nan], 'D':[1,2,3]}

In [65]:
df = pd.DataFrame(d)

In [66]:
df  #this shows that you can create a data frame even with missing values

     A    B  D
0  1.0  5.0  1
1  2.0  NaN  2
2  NaN  NaN  3

In [67]:
df.dropna() #this is to drop any row that contain a missing value
            # by defult this should be set to rows, if you want colums add
            # (axis = 1) or just (1)

     A    B  D
0  1.0  5.0  1

In [68]:
df.dropna(1)

   D
0  1
1  2
2  3

In [69]:
df.dropna(thresh=2) #minimum values to not be droped is 2

     A    B  D
0  1.0  5.0  1
1  2.0  NaN  2

In [70]:
df.fillna(value = 'Filled by user' ) #this is used to fill all missing values

                A               B  D
0               1               5  1
1               2  Filled by user  2
2  Filled by user  Filled by user  3

In [71]:
df['A'].fillna(value = 'only A is filled') 
#this is to fill missing values on A only

0                   1
1                   2
2    only A is filled
Name: A, dtype: object

In [72]:
df['A'].fillna(value = df['A'].mean())
#this is to fill missing values on A only with the mean of A

0    1.0
1    2.0
2    1.5
Name: A, dtype: float64

# GroupBy

aggregate function: a function that preforme an action on a group of data

In [73]:
data = {'Company':['GOOG','GOOG','MSFT','MSFT','FB','FB'],
       'Person':['Sam','Charlie','Amy','Vanessa','Carl','Sarah'],
       'Sales':[200,120,340,124,243,350]}

In [74]:
df = pd.DataFrame(data)

In [75]:
df

  Company   Person  Sales
0    GOOG      Sam    200
1    GOOG  Charlie    120
2    MSFT      Amy    340
3    MSFT  Vanessa    124
4      FB     Carl    243
5      FB    Sarah    350

In [76]:
byComp = df.groupby('Company')

In [77]:
byComp.mean() #always ignore any non valid column based on the action applied

         Sales
Company
FB       296.5
GOOG     160.0
MSFT     232.0

In [78]:
byComp.std()

              Sales
Company
FB        75.660426
GOOG      56.568542
MSFT     152.735065

In [79]:
byComp.sum()

         Sales
Company
FB         593
GOOG       320
MSFT       464

In [80]:
#you can add an index
byComp.sum().loc['FB'] #shows that you want the value of FB only

Sales    593
Name: FB, dtype: int64

In [81]:
df.groupby('Company').sum().loc['FB'] # you can do it all in one line as well

Sales    593
Name: FB, dtype: int64

In [82]:
df.groupby('Company').count() #this time the 'Person' column is valid as you can count them

         Person  Sales
Company
FB            2      2
GOOG          2      2
MSFT          2      2

In [83]:
df.groupby('Company').max() #max latest in alpabatic

          Person  Sales
Company
FB         Sarah    350
GOOG         Sam    200
MSFT     Vanessa    340

In [84]:
df.groupby('Company').describe().transpose() 
# to change formating of the table remove transpose

Company              FB        GOOG        MSFT
Sales count    2.000000    2.000000    2.000000
      mean   296.500000  160.000000  232.000000
      std     75.660426   56.568542  152.735065
      min    243.000000  120.000000  124.000000
      25%    269.750000  140.000000  178.000000
      50%    296.500000  160.000000  232.000000
      75%    323.250000  180.000000  286.000000
      max    350.000000  200.000000  340.000000

# Mergin, Joining, and Concatenating

see seprate notes

# Operations

#### calling unique values

In [128]:
df = pd.DataFrame({'col1':[1,2,3,4],'col2':[444,555,666,444],'col3':['abc','def','ghi','xyz']})
df.head()

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [129]:
df['col2'].unique() #returns the unique values of column 2

array([444, 555, 666], dtype=int64)

In [130]:
len(df['col2'].unique()) #to find the count of the data in column 2, or:

3

In [131]:
df['col2'].nunique() #A faster method

3

In [146]:
df['col2'].value_counts() #how many time each vale was repeated

444    2
555    1
666    1
Name: col2, dtype: int64

In [133]:
df

   col1  col2 col3
0     1   444  abc
1     2   555  def
2     3   666  ghi
3     4   444  xyz

In [134]:
df[(df['col1']>2) & (df['col2']==444)]

   col1  col2 col3
3     4   444  xyz

#### applied method

In [135]:
def times2(x):
    return x*2

In [144]:
df['col1'].sum()

10

In [137]:
df['col1'].apply(times2) #this is to apply my fucntion

0    2
1    4
2    6
3    8
Name: col1, dtype: int64

In [145]:
df['col3'].apply(len) #to find the length of each string in col3
# added apply because len is not a panda fucntion (needs checks)

0    3
1    3
2    3
3    3
Name: col3, dtype: int64

In [139]:
# applying a lambda expression with apply
# this saves you the time of creating a function before hand:
df['col2'].apply(lambda x:x*2)

0     888
1    1110
2    1332
3     888
Name: col2, dtype: int64

#### Summoning a columns and indexs as a list

In [97]:
df.columns # return a list of columns name'

Index(['col1', 'col2', 'col3'], dtype='object')

In [98]:
df.index #shows the index
# the result below, is because we didnt specifiy an index list

RangeIndex(start=0, stop=4, step=1)

#### sort

In [99]:
df.sort_values('col2') # this is to sort the dataframe by column 2]
# see index

   col1  col2 col3
0     1   444  abc
3     4   444  xyz
1     2   555  def
2     3   666  ghi

#### finding nul value

In [100]:
df.isnull() #because we dont have any null values

    col1   col2   col3
0  False  False  False
1  False  False  False
2  False  False  False
3  False  False  False

#### piviting

In [101]:
data = {'A':['foo','foo','foo','bar','bar','bar'],
     'B':['one','one','two','two','one','one'],
       'C':['x','y','x','y','x','y'],
       'D':[1,3,2,5,4,1]}

df = pd.DataFrame(data)

In [102]:
df

     A    B  C  D
0  foo  one  x  1
1  foo  one  y  3
2  foo  two  x  2
3  bar  two  y  5
4  bar  one  x  4
5  bar  one  y  1

In [103]:
df.pivot_table(values= 'D',index = ['A','B'], columns = ['C'])

C          x    y
A   B
bar one  4.0  1.0
    two  NaN  5.0
foo one  1.0  3.0
    two  2.0  NaN

# Data input and Output

In [104]:
pwd #to see the location of your jupyter notebook

'C:\\Users\\عبدالله\\Desktop\\udemy\\Juypter note book lecture notes\\original\\Refactored_Py_DS_ML_Bootcamp-master\\03-Python-for-Data-Analysis-Pandas'

#### csv

In [105]:
pd.read_csv('example')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

In [106]:
df = pd.read_csv('example')

In [107]:
df.to_csv('My_output',index= False ) 
#if we dont add index =false, then ur index will be added as a column

In [108]:
pd.read_csv('My_output')

    a   b   c   d
0   0   1   2   3
1   4   5   6   7
2   8   9  10  11
3  12  13  14  15

#### Excel

In [109]:
pd.read_excel('Excel_Sample.xlsx',sheet_name='Sheet1')

   Unnamed: 0   a   b   c   d
0           0   0   1   2   3
1           1   4   5   6   7
2           2   8   9  10  11
3           3  12  13  14  15

In [110]:
df.to_excel('Excel_Sample2.xlsx',sheet_name='Newsheet')

#### HTML link

In [111]:
# there is a link for fail bank from fdic

In [112]:
data = pd.read_html('http://www.fdic.gov/bank/individual/failed/banklist.html')

In [113]:
data #this brings every possible list found in the website

[                             Bank Name           City  ST   CERT  \
 0                 The First State Bank  Barboursville  WV  14361
 1                   Ericson State Bank        Ericson  NE  18265
 2     City National Bank of New Jersey         Newark  NJ  21111
 3                        Resolute Bank         Maumee  OH  58317
 4                Louisa Community Bank         Louisa  KY  58112
 ..                                 ...            ...  ..    ...
 556                 Superior Bank, FSB       Hinsdale  IL  32646
 557                Malta National Bank          Malta  OH   6629
 558    First Alliance Bank & Trust Co.     Manchester  NH  34264
 559  National State Bank of Metropolis     Metropolis  IL   3815
 560                   Bank of Honolulu       Honolulu  HI  21029

                    Acquiring Institution       Closing Date
 0                         MVB Bank, Inc.      April 3, 2020
 1             Farmers and Merchants Bank  February 14, 2020
 2                        Industrial Bank   November 1, 2019
 3                     Buckeye State Bank   October 25, 2019
 4      Kentucky Farmers Bank Corporation   October 25, 2019
 ..                                   ...                ...
 556                Superior Federal, FSB      July 27, 2001
 557                    North Valley Bank        May 3, 2001
 558  Southern New Hampshire Bank & Trust   February 2, 2001
 559              Banterra Bank of Marion  December 14, 2000
 560                   Bank of the Orient   October 13, 2000

 [561 rows x 6 columns]]

In [114]:
type(data)

list

In [115]:
data[0] # now i am chosing that i want the first list only

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"
...,...,...,...,...,...,...
556,"Superior Bank, FSB",Hinsdale,IL,32646,"Superior Federal, FSB","July 27, 2001"
557,Malta National Bank,Malta,OH,6629,North Valley Bank,"May 3, 2001"
558,First Alliance Bank & Trust Co.,Manchester,NH,34264,Southern New Hampshire Bank & Trust,"February 2, 2001"
559,National State Bank of Metropolis,Metropolis,IL,3815,Banterra Bank of Marion,"December 14, 2000"
560,Bank of Honolulu,Honolulu,HI,21029,Bank of the Orient,"October 13, 2000"

In [116]:
data[0].head() #

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date
0,The First State Bank,Barboursville,WV,14361,"MVB Bank, Inc.","April 3, 2020"
1,Ericson State Bank,Ericson,NE,18265,Farmers and Merchants Bank,"February 14, 2020"
2,City National Bank of New Jersey,Newark,NJ,21111,Industrial Bank,"November 1, 2019"
3,Resolute Bank,Maumee,OH,58317,Buckeye State Bank,"October 25, 2019"
4,Louisa Community Bank,Louisa,KY,58112,Kentucky Farmers Bank Corporation,"October 25, 2019"

In [117]:
ff = data[0]

In [118]:
ff.to_excel('bank list from the example.xlsx', sheet_name='sheet1' )
#('Excel_Sample2.xlsx',sheet_name='Newsheet')

#### Seq

In [119]:
### i dont know what seq is

In [120]:
from sqlalchemy import create_engine

In [121]:
engine = create_engine('sqlite:///:memory')

In [122]:
################# df.to_sql('my_table',engine)